#### UISaveAsOptions Members

---

|  |
| --- |
| UISaveAsOptions Class   Constructors   Methods   Properties   See Also |

The  UISaveAsOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | UISaveAsOptions | Default constructor. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  UISaveAsOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ShowOverwriteWarning | Identifies if UI should show an overwrite warning dialog. |

# See Also

UISaveAsOptions Class

Autodesk.Revit.UI Namespace